# 性格診断結果データ
# 人画の下一桁で判定する
# 山本さんへ
# もともと1,2,3...0の順番でしたが、データ構造上自然になるよう0,1,2,3...9の順に
# 判定結果を並べ替えています。
@seikaku = (
	# 0
	"陰気な者、頭脳俊敏なる者、意気地なし、大活動家など両極端で多くは苦労性で、健康と財物に恵まれず。判断力は強いが、孤立しやすい。稀に大成功者あり。",
	# 1
	"表面は大人しく何事も漸進的で物事に筋道を立てて理性的です。温和に見えるが内心は不屈の精神と、嫉みや疑いの気持があり、余り活動的でない。しかし人の上に立つ素養はある。",
	# 2
	"気力が乏しく、神経質で疑い深く、決断力に欠ける。自己防衛的な性格で言動に爽快さがなく、執着心が強く片意地で時に怒気を含むこともある。",
	# 3
	"鋭敏にして活動的な行動派で、自我も強く自信家です。感情が鋭く怒りやすい。敏腕で物事を上手く捌くが、耐久力がなくどことなく抜けている。旺盛な智力と動作が特徴です。",
	# 4
	"内心の急繰を無理に押さえて表面静穏で無気力にさえ見える者がある。また爆発的な癇癪を起こして反抗的なる者もあり。智力に優れ決断力に富むが、多くは神経質で労多くして証を得難い。",
	# 5
	"表面は穏やかで抱擁力と同化力も強いが、内心は粘り強くむしろ強情さがある。沈着で気前良く、人に引き立てられ慕われるが、馴れやすい面があり、名誉心と異性の愛が深い。",
	# 6
	"重厚雅量で、温和なるが意外と反発力強く決断力に欠け、小さな事に心悩ます。豪快偉人の風格を備うる人、ぼんやりして頼りない人などあり。人の制約を嫌い嫉み心と疑い深い。",
	# 7
	"何事にも鋭い切れ味、強情で自信家タイプ、打てば響く頭脳を持ち自我心も強く勝ち気で虚栄心も強く、不屈の忍耐力が特徴ではあるが、情に弱い。時に体裁を巧みに繕う。",
	# 8
	"頑固で一度言い出したら聞かない。同化融合の力が足らず。交際は円滑を欠き不平不満が起きやすい。義理堅く誠実で権力を欲し、情に脆く損をしやすい。",
	# 9
	"移り気で淡泊な性格。融通性に富み物事にこだわらない。頭の回転が速く、才知に富ながら物事に飽き性で安定できない。才略秀ずる者は大事を成すが、小才なるものは人のために損をしがち。"
);
