<?php
// 性格診断結果データ
// 人画の下一桁で判定する
Class Seikaku
{
	public $mongon;

	public function Seikaku() {
		$this->mongon = Array (
			"0" => "「<strong>陰忍智略型</strong>」<br>陰気な方、頭脳俊敏なる方、意気地のない方、大活動家など両極端のタイプで、多くは苦労性で、健康と財物に恵まれません。判断力は強いのですが、孤立しやすい傾向があります。小さなこせこせした事には向きません。稀に大成功者になる方もおられます。",
			"1" => "「<strong>健全発達型</strong>」<br>表面は大人しく、何事も漸進的で物事に筋道を立てて理性的に行動します。温和に見えるのですが、内心は不屈の精神と、嫉みや疑いの気持があるため余り活動的でないのですが、人の上に立つ素養があります。裏面は剛情でワンマンなので、これが表面に出ると遊び好きになったり、けじめが無くなったりします。",
			"2" => "「<strong>理想追及型</strong>」<br>気力が乏しく、神経質で疑い深いので、決断力に欠けます。自己防衛的な性格で言動に爽快さがなく、執着心が強いため、片意地でときどき怒気を含むことさえあります。発展向上心が旺盛なる方は意外な発達をすることもあります。+32ただし、主運32画のあなたは性格上の問題は特にありません。-32",
			"3" => "「<strong>才知鋭敏型</strong>」<br>鋭敏にして活動的な行動派で、積極性に富む明るい性格です。ただし感情が鋭く怒りやすい傾向があります。敏腕で物事を上手く捌くのですが、反面、あわてもので耐久力がなく、どことなく抜けている面があります。旺盛な智力と動作が特徴です。",
			"4" => "「<strong>神経過敏型</strong>」<br>ダークムードな外見を持ちます。内心の急繰を無理に押さえ、表面上静穏で無気力にさえ見える方もおられます。また爆発的な癇癪を起こして反抗的になる方もいます。智力に優れ決断力に富むのですが、たいていは神経質で労多くして証を得にくい傾向があります。ただし、+24主運24画のあなたには性格的な問題はありません。-24",
			"5" => "「<strong>福寿円満型</strong>」<br>人当たりが良く社交上手です。表面は穏やかで、抱擁力と同化力も強いのですが、内心は粘り強く、むしろ強情ささえあります。沈着で気前が良く、人に引き立てられ慕われるのですが、馴れやすい面があります。名誉心と異性の愛が深い方が多いです。",
			"6" => "「<strong>侠気象望型</strong>」<br>重厚でおおらかな気性で、温和ですが意外と反発力強い割に決断力に欠け、小さな事に心を悩ませます。豪快な偉人の風格を備えている方、ぼんやりして頼りない方などあります。人の制約を嫌い、嫉み心と疑い深い傾向があります。+6基礎運が6画のあなたは天徳晩成です。-6+16基礎運が16画のあなたは天徳晩成です。-16、+26基礎運が26画のあなたは英雄的波乱変動で浮き沈みが激しい傾向にあります。-26+36基礎運が36画のあなたは英雄的波乱変動で浮き沈みが激しい傾向にあります。-36+46基礎運が46画のあなたは英雄的波乱変動で浮き沈みが激しい傾向にあります。-46",
			"7" => "「<strong>意志貫徹型</strong>」<br>ざっくばらんな性格です。何事にも鋭い切れ味をもち、強情で自信家です。打てば響くような頭脳を持っており、自我心も強く勝ち気な一方、虚栄心も強いです。不屈の忍耐力が特徴ですが、情には弱いです。時に体裁をたくみににつくろう傾向があります。",
			"8" => "「<strong>剛健忍耐型</strong>」<br>「忍耐力のある根の良い野心家　頑固で一度言い出したら聞かない。同化融合の力が足らず。交際は円滑を欠き不平不満が起きやすい。正直者で義理堅く、情に脆く損をしやすい。",
			"9" => "「<strong>智謀理性の感情型</strong>」<br>移り気で淡泊な性格です。融通が利き物事にこだわりません。頭の回転がすこぶる速く才知に恵まれながらも、飽き性で安定しません。才略の優れている方は大きなことを成し遂げますが、凡才の場合人のために損をしがちになります。"
		);
	}
}
?>